#include <stdio.h>
#include <stdlib.h>
//μέσα στον κώδικα μου έχω χρησιμοποίησε συναρτήσεις όπως η fabs(x) και pow(x,y) οπότε 
//η χρήση της βιβλιοθήκης <math.h> είναι υποχρεωτική  
#include <math.h>

  
int main(int argc, char**argv){
//αρχικά ορίζω τον αριθμό των ορισμάτων που επιθυμώ 
    if(argc !=8){
        return 1;
    }
    //και ορίζω τις μεταβλητές που επιθυμώ από τον χρήστη τους συντελεστές και την μία τιμή του πολυωνύμου
     double a_0=strtod(argv[1], NULL);
     double a_1=strtod(argv[2], NULL);
     double a_2=strtod(argv[3], NULL);
     double a_3=strtod(argv[4], NULL);
     double a_4=strtod(argv[5], NULL);
     double a_5=strtod(argv[6], NULL);
     double x_0=strtod(argv[7], NULL);
//αρχικοποιώ μία μεταβλητή  x_1 με  x_0  και έπιετα η τιμή της θα αλλάζει σύμφωνα με τον τύπο 
//και εισάγω την i που θα με βοηθήσει στο loop   
    double x_1=x_0;
    int i;
    double f,f_,y;
//η f ανιπαραστά την συνάρτηση η f_ την παράγωγο
    for(i=0;i<1000;i++){//επιθυμούμε να εκτελεί μέχρι χίλιες επαναλήψεις και για αυτό έχω δομίσει το loop μου με αυτόν τον τρόπο
         y=x_1;//η y θα είναι η x_1 και θα μας βοηθήσει να εξετάσουμε έναν τρόπο εξόδου αργότερα
         f=a_0+a_1*x_1+a_2*pow(x_1,2)+a_3*pow(x_1,3)+a_4*pow(x_1,4)+a_5*pow(x_1,5);//ο τύπος της συνάρτησης
         f_=a_1+(2*a_2*x_1)+(3*a_3*pow(x_1,2))+(4*a_4*pow(x_1,3))+(5*a_5*pow(x_1,4));//ο τύπος της παραγώγου
        if(isnan(f_)){
        //εξετάζω αν η παράγωγος του x_1 είναι 0 τότε ολισθένει οπότε βγαίνω από το loop με το break και αποφεύγω πράξεις 
        //που θα κρασάρουν τον αλγόριθμο
            printf("nan\n");//και εμφανίζω το αντίστοιχο μήνυμα
            break;
        }
         x_1=x_1-(f/f_);//το x_1 παίρνει την τιμή του από τον τύπο που μας έχει δωθεί
         
       if(fabs(x_1-y)<pow(10,-6)){//εξετάζω αν τηρείται η προϋπόθεση: |xn+1 − xn| < 10−6 
            printf("%.2f\n",x_1);//αν ναι τερματίζω το loop με την break και εμφανίζω την ρίζα μου
            break;
        } 
    }

    if(i==1000){//εξετάζω αν ο αλγόρθμος έχει κάνει χίλιες επαναλήψεις κανονικά μέσα στο loop το i φτάνει μέχρι το 999 αλλά εγώ το 
    //εξετάζω έξω από αυτό που εχει φτασει 1000 για να βγει οπότε για να έχει κάνει χίλιες πρέπει i=1000
        printf("incomplete\n");//αν ναι εμφανίζω το κατάλληλο μήνυμα
        return 0;
    }
    
}
